{
	"simplified-taxonomy": [
		{
			"l1-taxonomy": "Account, portfolio, and team management", 
			"slug": "account-portfolio-and-team-management",
			"definition": "Admin tasks involving account creation, login, role-based access control, billing, account management, content review (legal & compliance), single sign-on (SSO) and multi-factor authentication (MFA) set up, onboarding, and offboarding.", 
			"children": [
				{
					"l2-taxonomy": "Register and log-in", 
					"slug": "register-and-log-in",
					"definition": "Account creation, collection of customer data, and login authentication via Single Sign-On (SSO) using the SAML standard.",
					"squad": ["User Management"]
				}, 
				{
					"l2-taxonomy": "Role-based account control", 
					"slug": "role-based-account-control",
					"definition": "User permission management based on roles at workspace and site levels.",
					"squad": ["User Management"]
				}, 
				{
					"l2-taxonomy": "Billing", 
					"slug": "billing",
					"definition": "Payment schedule, payment methods, plan management, transferring billing to new site owner, invoices and subscriptions.",
					"squad": ["Monetization"]
				}, 
				{
					"l2-taxonomy": "Account management", 
					"slug": "account-management",
					"definition": "Account recovery, password reset, account deletion and related procedures like backup and export, site deletion, and credit card removal.",
					"squad": ["User Management"]
				}, 
				{
					"l2-taxonomy": "Content review/Legal", 
					"slug": "content-review-legal",
					"definition": "The evaluation of Pantheon-hosted content to ensure its compliance with our Acceptable Use Policy (AUP) and other policies. This involves identifying and addressing potential ethical and legal issues.",
					"squad": ["Legal","AppSec","InfoSec"]
				}, 
				{
					"l2-taxonomy": "SSO/MFA", 
					"slug": "sso-mfa",
					"definition": "Single Sign-On (SSO) simplifies authentication using the Security Assertion Markup Language (SAML) standard, applicable to all email domains on Pantheon. Availability is contingent on account type, with Diamond accounts having access to SAML SSO. Agencies can consult their Partner Manager about SAML SSO qualification. \nMulti-Factor Authentication (MFA) enhances site security by verifying user identity using SMS, one-time codes, biometrics, location tracking, or hardware tokens. MFA can be used to log into site admin dashboards (such as WordPress), while general dashboard access is restricted to SSO only.", 
					"squad": ["User Management"]
				}, 
				{
					"l2-taxonomy": "Onboarding", 
					"slug": "onboarding",
					"definition": "Contextual guidance, documentation, videos, courses and training resources covering workflows and tools to help users create and launch sites.",
					"squad": ["User Management"]
				}, 
				{
					"l2-taxonomy": "Offboarding", 
					"slug": "offboarding",
					"definition": "Management of user access, data, accounts and workflows when individuals no longer require access to specific sites.",
					"squad": ["User Management"]
				} 
			]
		},
		{
			"l1-taxonomy": "Site and content building",
			"slug": "site-and-content-building",
			"definition": "Site setup and migration involving Drupal and WordPress applications, WordPress Multisite, JavaScript site, Custom Upstreams, WooCommerce, Pantheon Search (formerly Solr), ElasticSearch, database, backups, Filesystem, SFTP and Redis.",
			"children": [
				{
					"l2-taxonomy": "Drupal Application", 
					"slug": "drupal-application",
					"definition": "The development, testing and hosting of sites built on Drupal, an open-source content management system (CMS).",
					"squad": ["CMS Performance"]
				}, 
				{
					"l2-taxonomy": "WordPress Application", 
					"slug": "wordpress-application",
					"definition": "The development, testing and hosting of sites built on WordPress, a globally recognized open-source content management system (CMS).",
					"squad": ["CMS Performance"]
				}, 
				{
					"l2-taxonomy": "WordPress Multisite", 
					"slug": "wordpress-multisite",
					"definition": "An advanced feature for paid site plans (Gold, Platinum, Diamond) to create multiple sites from a single WordPress installation. To activate, customers can request a custom Multisite upstream from an account manager or sales team.",
					"squad": ["CMS Performance"]
				}, 
				{
					"l2-taxonomy": "JavaScript site", 
					"slug": "javascript-site",
					"definition": "Projects primarily crafted with JavaScript, leveraging its scripting capabilities to create dynamic and interactive user experiences.",
					"squad": ["Serverless Platform Infrastructure"]
				}, 
				{
					"l2-taxonomy": "Custom Upstreams",
					"slug": "custom-upstreams" ,
					"definition": "A web development solution that enables distribution of a single codebase to multiple sites independently and securely, empowering developers to retain control over a CMS while updating each site.",
					"squad": ["Lifecycle Operations"]
				}, 
				{
					"l2-taxonomy": "WooCommerce", 
					"slug": "woocommerce",
					"definition": "A WordPress plugin that transforms sites into online stores, offering features like product management, payment processing, order tracking, and customizable storefronts.",
					"squad": ["CMS Performance"]
				}, 
				{
					"l2-taxonomy": "Backups", 
					"slug": "backups",
					"definition": "Archives of Pantheon sites, including code, database, and files, are automatically generated daily. Manual backups are also available. ",
					"squad": ["File System"]
				}, 
				{
					"l2-taxonomy": "SFTP", 
					"slug": "sftp",
					"definition": "An encrypted method for transferring files between systems over a network to ensure secure access, upload and download of files from a remote server. This allows for direct development and file transfers to the test or live environments.",
					"squad": ["File System"]
				}, 
				{
					"l2-taxonomy": "Search Solr / Elastic", 
					"slug": "search-solr-elastic",
					"definition": "Pantheon Search (formerly Pantheon Solr) offers content indexing and searching for Drupal and WordPress sites. Alternatives like OpenSolr offer advanced features such as geospatial search or multilingual search.\nElasticSearch (not available yet) is a search and analytics engine for platform monitoring, security audit trails and issue resolution.",
					"squad": ["Site Runtime"]
				}, 
				{
					"l2-taxonomy": "Database", 
					"slug": "database",
					"definition": "Our platform primarily utilizes MariaDB but also supports MySQL database connections. Each environment (dev, test, live and Multidev) hosts its own database with distinct credentials, automatically integrated into site configuration.",
					"squad": ["Site Runtime"]
				}, 
				{
					"l2-taxonomy": "Filesystem", 
					"slug": "filesystem",
					"definition": "Stores static content like images and documents separately from code and database. Pantheon uses Valhalla, a cloud-based filesystem, for directories like wp-content/uploads (WordPress) and sites/default/files (Drupal).",
					"squad": ["File System"]
				}, 
				{
					"l2-taxonomy": "Redis", 
					"slug": "redis",
					"definition": "Redis CLI is used to manage Object Cache and facilitate high-performance caching and data management for Drupal and WordPress sites.",
					"squad": ["Platform Runtime"]
				}, 
				{
					"l2-taxonomy": "Site set-up", 
					"slug": "site-set-up",
					"definition": "Choosing a workspace, deploying CMS, initiating dev, test and live environments and Autopilot, generating machine tokens, installing and activating CMS plugins.",
					"squad": ["Lifecycle Operations"]
				}, 
				{
					"l2-taxonomy": "Site migrations", 
					"slug": "site-migrations",
					"definition": "Moving existing sites or upgrading sites to a higher version, involving importing code, connecting with SFTP, adding a database, and migrating files.",
					"squad": ["Lifecycle Operations"]
				} 
			]
		},
		{
			"l1-taxonomy": "Site serving & traffic delivery",
			"slug": "site-serving-and-traffic-delivery",
			"definition": "Site and traffic optimization involving features like AGCDN, domain and DNS management, CDN Cache, Edge Cache and HTTPS Certificates.",
			"children": [
				{
					"l2-taxonomy": "AGCDN", 
					"slug": "agcdn",
					"definition": "Offers advanced features to block malicious traffic, create geofencing/IP restrictions, rate limits with a website firewall, define valid user agent strings and query string sorting and filtering, and extend enterprise-grade security.",
					"squad": ["Edge Routing"]
				}, 
				{
					"l2-taxonomy": "Manage domains/DNS", 
					"slug": "manage-domains-dns",
					"definition": "Pantheon does not provide DNS management services. However, we offer guidance on configuring domains to point to a Pantheon site. Users can manage domains by adding, deleting and verifying ownership through their domain registrar or DNS provider.",
					"squad": ["Edge Routing"]
				}, 
				{
					"l2-taxonomy": "CDN Cache", 
					"slug": "cdn-cache",
					"definition": "Store static files like images, CSS, JavaScript on a CDN server to improve site performance and content delivery speed.",
					"squad": ["Edge Routing"]
				}, 
				{
					"l2-taxonomy": "Edge Cache", 
					"slug": "edge-cache",
					"definition": "Automatically available for Pantheon sites that do not have AGCDN, offering global CDN caching for improved site performance and content delivery speed.",
					"squad": ["Edge Routing"]
				}, 
				{
					"l2-taxonomy": "HTTPS Certificates", 
					"slug": "https-certificates",
					"definition": "Pantheon secures HTTPS communication with default Lets Encrypt SSL. Contract customers can use the Custom Certificates concierge service for tailored TLS certificates, while *credit card (online) customers get SSL certificates automatically. The process involves requesting, sending CSR to the CA, and adding the domain to the environment.\n*Credit card customers is the standardized external-facing term as of March 2024.",
					"squad": ["Edge Routing"]
				}
			]
		},
		{
			"l1-taxonomy": "Tooling, monitoring, and workflows",
			"slug": "tooling-monitoring-and-workflows",
			"definition": "Automation and integration tools including APIs, Quicksilver, Autopilot, Terminus, Multidev, Secure Integration and Managed Updates; monitoring solutions like New Relic, analytics tools and log forwarding; workflows for dev/test/live environments.",
			"children": [
				{
					"l2-taxonomy": "APIs & Automation - integrations", 
					"slug": "api-and-automation-integrations",
					"definition": "Task automation, external system integration, and custom solutions for data exchange and interactions between software systems. ",
					"squad": ["Lifecycle Operations"]
				}, 
				{
					"l2-taxonomy": "Quicksilver", 
					"slug": "quicksilver",
					"definition": "Automates WebOps workflow by running scripts covering chat-ops, database sanitization, deployment logging, and automated testing operations with a CI server.",
					"squad": ["Lifecycle Operations"]
				},
				{
					"l2-taxonomy": "Autopilot", 
					"slug": "autopilot",
					"definition": "Automates routine tasks like CMS theme and extension updates.",
					"squad": ["Lifecycle Operations"]
				},
				{
					"l2-taxonomy": "Dev Test Live", 
					"slug": "dev-test-live",
					"definition": "Each environment runs in a dedicated container, enabling developers to commit code in dev, combine code from dev and content from live in test, and deploy code to live.",
					"squad": ["Site Runtime"]
				},
				{
					"l2-taxonomy": "Multidev", 
					"slug": "multidev",
					"definition": "Extends beyond the standard dev, test and live environments to enable developers to fork the entire stack (code and content), work independently, and merge code changes into `master` branches.",
					"squad": ["Site Runtime"]
				},
				{
					"l2-taxonomy": "Secure Integration", 
					"slug": "secure-integration",
					"definition": "Enables site migration while safeguarding data behind firewalls without server configuration, through an encrypted tunnel between each application container and a secure outbound gateway on the platform. It offers an alternative to traditional VPN solutions.",
					"squad": ["CMS Infrastructure"]
				},
				{
					"l2-taxonomy": "Terminus", 
					"slug": "terminus",
					"definition": "Offers an alternative way for executing actions typically performed through the dashboard by entering commands in the terminal. Users can create new sites, create and delete Multidev environments, clone environments, check and apply upstream updates, deploy code, and run Drush and WP-CLI commands.",
					"squad": ["Lifecycle Operations"]
				},
				{
					"l2-taxonomy": "Analytics", 
					"slug": "analytics",
					"definition": "Tools like Edge Integrations with Google Tag Manager and Google Analytics deliver personalized content based on user characteristics, New Relic offers real-time performance insights, and the Metrics tool in site dashboard provides metrics like unique visits, pages served, and cache hit ratio.",
					"squad": ["Dashboard"]
				},
				{
					"l2-taxonomy": "New Relic", 
					"slug": "new-relic",
					"definition": "Offers performance monitoring and real-time performance insights for Sandbox sites, as well as Performance and Elite site plans.",
					"squad": ["Lifecycle Operations"]
				},
				{
					"l2-taxonomy": "Managed Updates", 
					"slug": "managed-updates",
					"definition": "Includes core updates, module/plugin updates, and Visual Regression Testing (VRT). Offered in 3 versions—Premium (for standalone sites with custom workflows), Lite (for standard sites), and Portfolio Upstreams (for customers managing site collections using Custom Upstreams).",
					"squad": ["CSE","Professional Services"]
				},
				{
					"l2-taxonomy": "Log forwarding", 
					"slug": "log-forwarding",
					"definition": "Supports centralized monitoring and analysis, integrated with tools like New Relic for error and performance issue diagnostics.",
					"squad": ["Site Runtime"]
				},
				{
					"l2-taxonomy": "Integrated Composer", 
					"slug": "integrated-composer",
					"definition": "By treating Drupal and WordPress core files as managed dependencies, this feature allows for one-click updates from the dashboard for upstream updates and composer dependencies on composer-managed sites.",
					"squad": ["Lifecycle Operations"]
				},
				{
					"l2-taxonomy": "Build Tools", 
					"slug": "build-tools",
					"definition": "Connects Pantheon with users’ CI (continuous integration) services and external Git providers to offer composer support, automated testing, extra Terminus commands, and best practices for advanced WebOps workflow.",
					"squad": ["Lifecycle Operations"]
				}
			]
		},
		{
			"l1-taxonomy": "Infrastructure",
			"slug": "infrastructure",
			"definition": "The components that support our platform’s functionality and performance, like Multizone Failover, SMTP, code repository, logs, and Google Cloud Platform (GCP) regions.",
			"children": [
				{
					"l2-taxonomy": "Multizone Failover", 
					"slug": "multizone-failover",
					"definition": "A disaster recovery solution offering a seamless transition for 99.99% uptime in the event of a data center failure, built for mission-critical sites to migrate the impact of outages, downtime and data integrity issues.",
					"squad": ["CMS Infrastructure"]
				},
				{
					"l2-taxonomy": "SMTP", 
					"slug": "smtp",
					"definition": "The standard protocol for outgoing email delivery from Drupal and WordPress sites, ensuring reliable email transmission (like password reset emails). Pantheon suggests configuring external SMTP service providers like Mailgun or SendGrid for improved deliverability.",
					"squad": ["CMS Infrastructure"]
				},
				{
					"l2-taxonomy": "Code Repository", 
					"slug": "code-repository",
					"definition": "A hub for version-controlled source code storage using Git, containing the entire site codebase, core files, custom modules, plugins and themes. Pantheon provides Git repositories, supporting collaboration and syncing with external repositories.",
					"squad": ["Lifecycle Operations"]
				},
				{
					"l2-taxonomy": "Logs", 
					"slug": "logs",
					"definition": "Records related to errors, access and PHP (for Multidev, dev, test and live environments) retrievable through SFTP or Drupal. Fastly on Pantheon offers additional features for record and media storage.",
					"squad": ["SRE"]
				},
				{
					"l2-taxonomy": "GCP Region", 
					"slug": "gcp-region",
					"definition": "A location where Google Cloud Platform (GCP) has data centers providing cloud services. Pantheon transitioned from Rackspace to GCP for its primary infrastructure, aiming to boost performance, increase uptime, and leverage advanced GCP capabilities.",
					"squad": ["CMS Infrastructure"]
				}
			]
		},
		{
			"l1-taxonomy": "Platform usability",
			"slug": "platform-usability",
			"definition": "The platform’s user interface (UI) and user experience (UX), covering design, functionality and performance. This includes aspects like build times, site performance, dashboard performance and stability, support accessibility, incident management, error handling, and value proposition.",
			"children": [
				{
					"l2-taxonomy": "Dashboard UX/IO (error handling too)", 
					"slug": "dashboard-ux-ui",
					"definition": "The usability of dashboard features, user interface, navigation, product description, error handling, and accessibility features.",
					"squad": ["Dashboard"]
				},
				{
					"l2-taxonomy": "Build times", 
					"slug": "build-times",
					"definition": "The time it takes for the platform to compile and deploy updates to a site's codebase, contributing to the overall efficiency of site operations.",
					"squad": ["Platform Runtime","CMS Performance"]
				},
				{
					"l2-taxonomy": "Site performance", 
					"slug": "site-performance",
					"definition": "How well a site operates in terms of speed, responsiveness and overall user experience, including factors like page load times, server response times, and the efficiency of code execution.",
					"squad": ["CMS Infrastructure"]
				},
				{
					"l2-taxonomy": "Get support", 
					"slug": "get-support",
					"definition": "Issues related to accounts, billing, workspaces, sites and incidents can be addressed through support ticket, live chat, or premium options for Diamond and Platinum customers. ",
					"squad": ["Dashboard"]
				},
				{
					"l2-taxonomy": "Dashboard performance & stability", 
					"slug": "dashboard-performance-and-stability",
					"definition": "The reliability and responsiveness of the dashboard to ensure operations without disruptions, including factors like build times, site performance, support accessibility, incident management, and error handling.",
					"squad": ["Dashboard"]
				},
				{
					"l2-taxonomy": "Value proposition", 
					"slug": "value-proposition",
					"definition": "The benefits that Pantheon offers to users, distinguishing it from competitors and providing compelling reasons for choosing our services. It highlights how we address customer pain points and deliver value.",
					"squad": ["Sales","Marketing"]
				}
			]
		},
		{
			"l1-taxonomy": "Other",
			"slug": "other",
			"definition": "Workflows, tools and features not specified in other defined categories. (No squad assigned)"
		}
	]
}